<a href="https://colab.research.google.com/github/Renata-Thomazelli/mentoria2021/blob/main/wheat_production.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Analysing the wheat production

In [1]:
# Importing Drive
from google.colab import drive

drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [2]:
#Importing 
import pandas as pd
import numpy as np
import chardet

## Reading CSV

In [3]:

file_path ='/content/drive/MyDrive/Data_Lake/wheat_production/'
file = 'paises_fechados_2.csv'

Reading encoding

In [4]:
with open(f"{file_path}{file}", 'rb') as encoding:
    r_encoding = chardet.detect(encoding.read(100000))
r_encoding

{'confidence': 1.0, 'encoding': 'ascii', 'language': ''}

Reading CSV

In [5]:
with open (f"{file_path}{file}",'r',encoding=r_encoding['encoding']) as countries:
  df_countries = pd.read_csv(countries)

# Dataframe

In [6]:
df_countries

       Country   Australia      Brazil  ...      Turkey United Kingdom United States
0    Commodity       Wheat       Wheat  ...       Wheat          Wheat         Wheat
1    Attribute  Production  Production  ...  Production     Production    Production
2    Frequency           A           A  ...           A              A             A
3   1960-01-01      7450.0       350.0  ...      7000.0            NaN       36877.0
4   1961-01-01      6727.0       250.0  ...      6336.0            NaN       33557.0
..         ...         ...         ...  ...         ...            ...           ...
60  2017-01-01     20941.0      4264.0  ...     21000.0        14444.0       47380.0
61  2018-01-01     17598.0      5428.0  ...     19000.0        13455.0       51306.0
62  2019-01-01     15200.0      5200.0  ...     17500.0        15600.0       52581.0
63  2020-01-01     33000.0      6250.0  ...     18250.0         9658.0       49691.0
64  2021-01-01     27000.0      6800.0  ...     17250.0        14100.0       50948.0

[65 rows x 13 columns]

DEF TO RENAME NAMES

In [7]:
def replace (col): 
    return col.replace("-01-01",'')

In [8]:
df_countries.shape

(65, 13)

In [9]:
anos = {"Country":"Years"}
df_countries=\
(
    df_countries.drop(range(0,3))
    .rename(columns=anos)
    .set_index("Years")
    .rename(index=replace)
 )

In [10]:
df_countries.shape

(62, 12)

In [11]:
df_countries

      Australia  Brazil   Canada  ...   Turkey United Kingdom United States
Years                             ...
1960     7450.0   350.0  14108.0  ...   7000.0            NaN       36877.0
1961     6727.0   250.0   7713.0  ...   6336.0            NaN       33557.0
1962     8353.0   256.0  15392.0  ...   6804.0            NaN       29719.0
1963     8925.0   100.0  19690.0  ...   7892.0            NaN       31216.0
1964    10037.0   226.0  16349.0  ...   7000.0            NaN       34917.0
...         ...     ...      ...  ...      ...            ...           ...
2017    20941.0  4264.0  30377.0  ...  21000.0        14444.0       47380.0
2018    17598.0  5428.0  32352.0  ...  19000.0        13455.0       51306.0
2019    15200.0  5200.0  32670.0  ...  17500.0        15600.0       52581.0
2020    33000.0  6250.0  35183.0  ...  18250.0         9658.0       49691.0
2021    27000.0  6800.0  32000.0  ...  17250.0        14100.0       50948.0

[62 rows x 12 columns]

In [12]:
df_countries.isna().sum()

Australia          0
Brazil             0
Canada             0
China              0
Egypt              0
India              0
Indonesia          0
Philippines        0
Russia            27
Turkey             0
United Kingdom    56
United States      0
dtype: int64

In [13]:
#fillna and changing types
df_countries =\
(
    df_countries.fillna(0)
    .astype(float)
    .astype(int)
   
)

In [14]:
df_countries

       Australia  Brazil  Canada  ...  Turkey  United Kingdom  United States
Years                             ...
1960        7450     350   14108  ...    7000               0          36877
1961        6727     250    7713  ...    6336               0          33557
1962        8353     256   15392  ...    6804               0          29719
1963        8925     100   19690  ...    7892               0          31216
1964       10037     226   16349  ...    7000               0          34917
...          ...     ...     ...  ...     ...             ...            ...
2017       20941    4264   30377  ...   21000           14444          47380
2018       17598    5428   32352  ...   19000           13455          51306
2019       15200    5200   32670  ...   17500           15600          52581
2020       33000    6250   35183  ...   18250            9658          49691
2021       27000    6800   32000  ...   17250           14100          50948

[62 rows x 12 columns]

In [15]:
#checking the usage
df_countries.info()

<class 'pandas.core.frame.DataFrame'>
Index: 62 entries, 1960 to 2021
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Australia       62 non-null     int64
 1   Brazil          62 non-null     int64
 2   Canada          62 non-null     int64
 3   China           62 non-null     int64
 4   Egypt           62 non-null     int64
 5   India           62 non-null     int64
 6   Indonesia       62 non-null     int64
 7   Philippines     62 non-null     int64
 8   Russia          62 non-null     int64
 9   Turkey          62 non-null     int64
 10  United Kingdom  62 non-null     int64
 11  United States   62 non-null     int64
dtypes: int64(12)
memory usage: 6.3+ KB

DADOS ESTATÍSTICOS

In [16]:
estatistica = \
(
    df_countries.describe(include=[np.number])
    .T
    .astype(int)
    .sort_values('max',ascending=False)

)
estatistica

                count   mean    std    min    25%    50%     75%     max
China              62  81563  38683  14250  42133  90548  112341  136000
India              62  53294  29405   9854  27019  54622   75046  108000
Russia             62  28359  27883      0      0  33085   47456   85354
United States      62  54305  11406  29719  47615  55969   62351   75805
Canada             62  23379   6491   7713  17833  24266   27241   37589
Australia          62  16519   6893   6590  10623  16143   21988   33000
Turkey             62  14017   3950   6336  11750  15375   16950   21000
United Kingdom     62   1316   4098      0      0      0       0   15600
Egypt              62   4506   2863   1272   1820   4193    7334    9000
Brazil             62   3195   2003    100   1894   2798    5275    6800
Indonesia          62      0      0      0      0      0       0       0
Philippines        62      0      0      0      0      0       0       0

In [17]:
df_countries.sort_index(ascending = False)

       Australia  Brazil  Canada  ...  Turkey  United Kingdom  United States
Years                             ...
2021       27000    6800   32000  ...   17250           14100          50948
2020       33000    6250   35183  ...   18250            9658          49691
2019       15200    5200   32670  ...   17500           15600          52581
2018       17598    5428   32352  ...   19000           13455          51306
2017       20941    4264   30377  ...   21000           14444          47380
...          ...     ...     ...  ...     ...             ...            ...
1964       10037     226   16349  ...    7000               0          34917
1963        8925     100   19690  ...    7892               0          31216
1962        8353     256   15392  ...    6804               0          29719
1961        6727     250    7713  ...    6336               0          33557
1960        7450     350   14108  ...    7000               0          36877

[62 rows x 12 columns]

In [18]:
col = df_countries.columns
col

Index(['Australia', 'Brazil', 'Canada', 'China', 'Egypt', 'India', 'Indonesia',
       'Philippines', 'Russia', 'Turkey', 'United Kingdom', 'United States'],
      dtype='object')

In [19]:
df_countries.reset_index()

   Years  Australia  Brazil  ...  Turkey  United Kingdom  United States
0   1960       7450     350  ...    7000               0          36877
1   1961       6727     250  ...    6336               0          33557
2   1962       8353     256  ...    6804               0          29719
3   1963       8925     100  ...    7892               0          31216
4   1964      10037     226  ...    7000               0          34917
..   ...        ...     ...  ...     ...             ...            ...
57  2017      20941    4264  ...   21000           14444          47380
58  2018      17598    5428  ...   19000           13455          51306
59  2019      15200    5200  ...   17500           15600          52581
60  2020      33000    6250  ...   18250            9658          49691
61  2021      27000    6800  ...   17250           14100          50948

[62 rows x 13 columns]

##The Top producer of each Year

In [20]:
tops_for_year=\
(
    df_countries.reset_index()
    .melt(id_vars = ["Years"],var_name="Countries",value_name = "Production")
    .sort_values("Production", ascending= False)
    .drop_duplicates(subset="Years")
    .set_index("Years")
)
tops_for_year

           Countries  Production
Years
2021           China      136000
2017           China      134334
2020           China      134250
2019           China      133590
2016           China      133271
...              ...         ...
1965   United States       34917
1964   United States       34917
1961   United States       33557
1963   United States       31216
1962   United States       29719

[62 rows x 2 columns]

In [21]:
counting_zeros= (df_countries.reset_index().eq(0).sum())
counting_zeros

Years              0
Australia          0
Brazil             0
Canada             0
China              0
Egypt              0
India              0
Indonesia         62
Philippines       62
Russia            27
Turkey             0
United Kingdom    56
United States      0
dtype: int64

In [22]:
counting_no_zeros=df_countries.reset_index().astype(bool).sum(axis=0)
counting_no_zeros

Years             62
Australia         62
Brazil            62
Canada            62
China             62
Egypt             62
India             62
Indonesia          0
Philippines        0
Russia            35
Turkey            62
United Kingdom     6
United States     62
dtype: int64

In [23]:
lista =[]

for i,v in counting_no_zeros.iteritems():
  if v !=0:
    lista.append(i)


print(lista)

['Years', 'Australia', 'Brazil', 'Canada', 'China', 'Egypt', 'India', 'Russia', 'Turkey', 'United Kingdom', 'United States']

## The last placed at each year

In [32]:
last_for_years=\
(
    #dataframe original
    df_countries.reset_index()
    #filtering years and countries that have no zero in the entire column
    .filter(items=lista)
    #unpivoting
    .melt(id_vars = ["Years"],var_name="Countries",value_name = "Production")
    #sorting_values
    .sort_values(["Years","Production"], ascending= [False,True])
  )
    
last_for_years

    Years       Countries  Production
123  2021          Brazil        6800
309  2021           Egypt        9000
557  2021  United Kingdom       14100
495  2021          Turkey       17250
61   2021       Australia       27000
..    ...             ...         ...
0    1960       Australia        7450
310  1960           India       10320
124  1960          Canada       14108
186  1960           China       20960
558  1960   United States       36877

[620 rows x 3 columns]

In [33]:
last_for_years=\
(
    last_for_years.loc[last_for_years["Production"]>0,:]
    #drop duplicates
    .drop_duplicates(subset="Years")
    #setting the index
    .set_index("Years")

)

last_for_years

      Countries  Production
Years
2021     Brazil        6800
2020     Brazil        6250
2019     Brazil        5200
2018     Brazil        5428
2017     Brazil        4264
...         ...         ...
1964     Brazil         226
1963     Brazil         100
1962     Brazil         256
1961     Brazil         250
1960     Brazil         350

[62 rows x 2 columns]

In [ ]:
type(last_for_years)

In [ ]:
last_for_years.Production.max()

In [ ]:
last_for_years.replace(0,np.nan)